In [1]:
import pandas as pd
import numpy as np

from pandas import DataFrame, Series
from numpy.random import randn

In [2]:
ser = Series(randn(6), index=[[1,1,1,2,2,2], ['a','b','c','a','b','c']])
ser

1  a    0.197647
   b    1.014694
   c   -1.264327
2  a    0.503515
   b   -1.062197
   c    0.774361
dtype: float64

In [3]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [4]:
ser[1]

a    0.197647
b    1.014694
c   -1.264327
dtype: float64

In [5]:
ser[2]

a    0.503515
b   -1.062197
c    0.774361
dtype: float64

In [6]:
ser

1  a    0.197647
   b    1.014694
   c   -1.264327
2  a    0.503515
   b   -1.062197
   c    0.774361
dtype: float64

In [7]:
ser[:,'a']

1    0.197647
2    0.503515
dtype: float64

In [8]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.197647  1.014694 -1.264327
2  0.503515 -1.062197  0.774361

In [9]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]], columns=[['Lahore','London','New York','Tokyo'],['cold', 'hot','hot', 'cold']]) 
dframe2

    Lahore London New York Tokyo
      cold    hot      hot  cold
a 1      0      1        2     3
  2      4      5        6     7
b 1      8      9       10    11
  2     12     13       14    15

In [10]:
dframe2.index.names = ['Index_1','Index_2']

dframe2.columns.names = ['Cities','Temp']

dframe2

Cities          Lahore London New York Tokyo
Temp              cold    hot      hot  cold
Index_1 Index_2
a       1            0      1        2     3
        2            4      5        6     7
b       1            8      9       10    11
        2           12     13       14    15